XcaXds.Tests/TestData/IntegrationTests/IT_iti39-request-multipart.txt

--MIMEBoundary_cab1d70f258a850f002aa2ab5645aaa9622f017d951cfe8d
Content-Type: application/xop+xml; charset=UTF-8; type="application/soap+xml"
Content-Transfer-Encoding: binary
Content-ID: <0.dab1d70f258a850f002aa2ab5645aaa9622f017d951cfe8d@apache.org>

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:ReplyTo soapenv:mustUnderstand="1">
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:To>https://bjarne-sykehus.t-xcads.pjd.nhn.no/XCA/services/RespondingGatewayService</wsa:To>
		<wsa:MessageID>urn:uuid:f204d2f1-0e01-4bb8-952b-f50d075e3fc2</wsa:MessageID>
		<wsa:Action>urn:ihe:iti:2007:CrossGatewayRetrieve</wsa:Action>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" ID="_96e43604-8350-451f-b643-89627045d066" IssueInstant="2025-09-02T13:23:58.628Z" Version="2.0">
				<saml:Issuer>https://helseid-xdssaml.test.nhn.no</saml:Issuer>
				<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
					<SignedInfo>
						<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
						<SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
						<Reference URI="#_96e43604-8350-451f-b643-89627045d066">
							<Transforms>
								<Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
								<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
							</Transforms>
							<DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
							<DigestValue>FyB9gOuQkTiJnQ5s+p28uvNTBQJ/IcVqJPhY86Ukm3Y=</DigestValue>
						</Reference>
					</SignedInfo>
					<SignatureValue>RA/s</SignatureValue>
					<KeyInfo>
						<X509Data>
							<X509Certificate>+aWz62q5LDrC8m4F6qHgRiI7BEcaZCrVyRllLXr4bCsuFk6oDk=</X509Certificate>
						</X509Data>
					</KeyInfo>
				</Signature>
				<saml:Subject>
					<saml:NameID>05898597468</saml:NameID>
					<saml:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"/>
				</saml:Subject>
				<saml:Conditions NotBefore="2025-09-02T13:23:58.628Z" NotOnOrAfter="2025-09-02T14:23:58.628Z">
					<saml:AudienceRestriction>
						<saml:Audience>nhn:dokumentdeling-saml</saml:Audience>
					</saml:AudienceRestriction>
				</saml:Conditions>
				<saml:AttributeStatement>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
						<saml:AttributeValue>GRØNN VITS</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:role">
						<saml:AttributeValue>&lt;Role xmlns="urn:hl7-org:v3" xsi:type="CE" code="LE" codeSystem="urn:oid:2.16.578.1.12.4.1.1.9060" codeSystemName="Kategori helsepersonell" displayName="Lege"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:no:ehelse:saml:1.0:subject:homeCommunityId">
						<saml:AttributeValue>2.16.578.1.12.4.1.7.1.1</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:2.0:subject:npi">
						<saml:AttributeValue>565501872</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeOfUse">
						<saml:AttributeValue>&lt;PurposeOfUse xmlns="urn:hl7-org:v3" xsi:type="CE" code="TREAT" codeSystem="urn:oid:2.16.840.1.113883.1.11.20448" codeSystemName="PurposeOfUse (HL7)" displayName="Treatment"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
						<saml:AttributeValue>12119000465^^^&amp;amp;2.16.578.1.12.4.1.4.1&amp;amp;ISO</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:no:ehelse:saml:1.0:subject:SecurityLevel">
						<saml:AttributeValue>4</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:no:ehelse:saml:1.0:subject:Scope">
						<saml:AttributeValue>journaldokumenter_helsepersonell</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:no:ehelse:saml:1.0:subject:Authentication_method">
						<saml:AttributeValue a:nil="true" xmlns:a="http://www.w3.org/2001/XMLSchema-instance"/>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xacml:1.0:subject:subject-id">
						<saml:AttributeValue>GRØNN VITS</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
						<saml:AttributeValue>STIFTELSEN BETANIEN HOSPITAL SKIEN</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
						<saml:AttributeValue>&lt;id xmlns="urn:hl7-org:v3" xsi:type="II" extension="981275721" root="urn:oid:2.16.578.1.12.4.1.4.101" assigningAuthorityName="https://www.brreg.no/" displayable="true"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:child-organization">
						<saml:AttributeValue>&lt;id xmlns="urn:hl7-org:v3" xsi:type="II" extension="873255102" root="urn:oid:2.16.578.1.12.4.1.4.101" assigningAuthorityName="https://www.brreg.no/" displayable="true"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
						<saml:AttributeValue>&lt;Role xmlns="urn:hl7-org:v3" xsi:type="CE" code="LE" codeSystem="urn:oid:2.16.578.1.12.4.1.1.9060" codeSystemName="Kategori helsepersonell" displayName="Lege"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:ihe:iti:xca:2010:homeCommunityId">
						<saml:AttributeValue>2.16.578.1.12.4.1.7.1.1</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:npi">
						<saml:AttributeValue>565501872</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:ihe:iti:xua:2017:subject:provider-identifier">
						<saml:AttributeValue>&lt;id xmlns="urn:hl7-org:v3" type="II" extension="565501872" root="2.16.578.1.12.4.1.4.4" displayable="false"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xacml:1.0:resource:resource-id">
						<saml:AttributeValue>12119000465^^^&amp;amp;2.16.578.1.12.4.1.4.1&amp;amp;ISO</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:no:ehelse:saml:1.0:subject:client_id">
						<saml:AttributeValue>ea1b0c25-154d-483c-abeb-cdf2e09d0a45</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:nhn:trust-framework:1.0:ext:subject:child-organization-name">
						<saml:AttributeValue>BETANIEN HOSPITAL</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:nhn:trust-framework:1.0:ext:resource:child-organization-name">
						<saml:AttributeValue>BETANIEN HOSPITAL</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:nhn:trust-framework:1.0:ext:resource:child-organization">
						<saml:AttributeValue>&lt;id xmlns="urn:hl7-org:v3" xsi:type="II" extension="873255102" root="urn:oid:2.16.578.1.12.4.1.4.101" assigningAuthorityName="https://www.brreg.no/" displayable="true"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oasis:names:tc:xacml:2.0:action:purpose">
						<saml:AttributeValue>&lt;Purpose xmlns="urn:hl7-org:v3" xsi:type="CE" code="TREAT" codeSystem="urn:oid:2.16.840.1.113883.1.11.20448" displayName="Treatment"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:nhn:trust-framework:1.0:ext:care-relationship:healthcare-service">
						<saml:AttributeValue>&lt;HealthcareService xmlns="urn:hl7-org:v3" xsi:type="CE" code="01" codeSystem="urn:oid:2.16.578.1.12.4.1.1.8666" displayName="Bedriftshelsetjeneste" assigningAuthorityName="https://volven.no/"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:nhn:trust-framework:1.0:ext:care-relationship:purpose-of-use-details">
						<saml:AttributeValue>&lt;purpose-of-use-details xmlns="urn:hl7-org:v3" xsi:type="CE" code="BEHANDLER" codeSystem="urn:AuditEventHL7Norway/CodeSystem/carerelation" displayName="Bruker har behandlingsansvar for pasienten" assigningAuthorityName="https://www.hl7.no/"/></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:nhn:trust-framework:1.0:ext:care-relationship:decision-ref">
						<saml:AttributeValue>&lt;decision-ref>&lt;id value="f193b85e-726c-4069-a503-f17e7ba40135" />&lt;user-selected value="True" />&lt;/decision-ref></saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:ihe:iti:xua:2012:acp">
						<saml:AttributeValue a:nil="true" xmlns:a="http://www.w3.org/2001/XMLSchema-instance"/>
					</saml:Attribute>
					<saml:Attribute Name="urn:ihe:iti:bppc:2007:docid">
						<saml:AttributeValue a:nil="true" xmlns:a="http://www.w3.org/2001/XMLSchema-instance"/>
					</saml:Attribute>
				</saml:AttributeStatement>
				<saml:AuthnStatement AuthnInstant="2025-09-02T13:23:15.000Z" SessionNotOnOrAfter="2025-09-02T14:23:58.000Z">
					<saml:AuthnContext>
						<saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml:AuthnContextClassRef>
					</saml:AuthnContext>
				</saml:AuthnStatement>
			</saml:Assertion>
			<u:Timestamp xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<u:Created>2025-09-02T13:23:58Z</u:Created>
				<u:Expires>2025-09-02T13:38:58Z</u:Expires>
			</u:Timestamp>
		</wsse:Security>
		<sense:context xmlns:sense="http://sense.ith-icoserve.com/context/" xmlns:wsctx="http://docs.oasis-open.org/ws-caf/2005/10/wsctx">
			<wsctx:context-identifier>urn:uuid:27d432ba-8b55-45f5-94f7-2796a4c41b81</wsctx:context-identifier>
			<wsctx:context-service>
				<sense:service>XCA</sense:service>
			</wsctx:context-service>
		</sense:context>
	</soapenv:Header>
	<soapenv:Body>
		<ns3:RetrieveDocumentSetRequest xmlns:ns3="urn:ihe:iti:xds-b:2007">
			<ns3:DocumentRequest>
				<ns3:HomeCommunityId>urn:oid:2.16.578.1.12.4.5.100.15</ns3:HomeCommunityId>
				<ns3:RepositoryUniqueId>2.16.578.1.12.4.5.100.15.25</ns3:RepositoryUniqueId>
				<ns3:DocumentUniqueId>8f3b8038-5122-4e1b-8af4-29bb8759e8ae</ns3:DocumentUniqueId>
			</ns3:DocumentRequest>
		</ns3:RetrieveDocumentSetRequest>
	</soapenv:Body>
</soapenv:Envelope>

--MIMEBoundary_cab1d70f258a850f002aa2ab5645aaa9622f017d951cfe8d--
